app/Controllers/Filtros.php


        return $this->getResponse([
            'message' => 'Data filtro',
            'servicios' => $modelServicio->where('estatus', 1)->whereIn('idAnfitrion',$arrayAnfitriones)->findAll(),
            'usuarios' => $modelUsuario->findAll(),
            'anfitriones' => $modelAnfitrion->whereIn('idAnfitrion',$arrayAnfitriones)->findAll(),
            'municipios' => $modelMunicio->findAll(),
            'tarifas' => $modelTarifa->findAll(),
            'tipoHospedaje' => $modelTipoHospedaje->findAll(),
            'imagenes' => $modelImagen->findAll(),
            'paises' => $modelPais->findAll(),
            'departamentos' => $modelDepartamentos->findAll()
---
SELECT *
FROM `tbl_servicios`
WHERE `estatus` = 1
AND `idAnfitrion` IN ('7','7','8','8')
AND `tbl_servicios`.`date_delete` IS NULL
SELECT *
FROM `tbl_usuarios`
SELECT *
FROM `tbl_anfitriones`
WHERE `idAnfitrion` IN ('7','7','8','8')
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_imagenes`
SELECT *
FROM `tbl_paises`
SELECT *
FROM `tbl_departamentos`

    private function eliminarFechasReservadas(){
        $modelFechasReservadas = model('FechasReservasModel');
        $date = date('Y-m-d 00:00:00');

        $arrayEliminar = $modelFechasReservadas->where('fechaSalida <', $date)->findColumn('idFecha');

        if($arrayEliminar == null){
            $arrayEliminar[] = '';
        }

        $modelFechasReservadas->delete($arrayEliminar);
---
DELETE FROM `tbl_fechas_reservas`
WHERE `idFecha` IN ('')