app/Controllers/Servicios.php

    public function servicios(){
        $modelServicio = model('ServiciosModel');
        $modelImagen = model('ImagenesModel');
        $modelUsuario = model('UserModel');
        $modelAnfitrion = model('AnfitrionesModel');
        $modelMunicio = model('MunicipioModel');
        $modelTarifa = model('TarifasModel');
        $modelTipoHospedaje = model('TiposHospedajesModel');
        return $this->getResponse([
            'message' => 'Servicios',
            'servicios' => $modelServicio->where('estatus', 1)->findAll(),
            'usuarios' => $modelUsuario->findAll(),
            'anfitriones' => $modelAnfitrion->findAll(),
            'municipios' => $modelMunicio->findAll(),
            'tarifas' => $modelTarifa->findAll(),
            'tipoHospedaje' => $modelTipoHospedaje->findAll(),
            'imagenes' => $modelImagen->findAll(),
---
SELECT *
FROM `tbl_anfitriones`
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_imagenes`

        public function usuarios($id){
        $modelUsuario = model('UserModel');
        $modelAnfitrion = model('AnfitrionesModel');

        return $this->getResponse([
            'message' => 'Usuarios',
            'usuario' => $modelUsuario->where('idUsuario', $id)->findAll(),
---
SELECT *
FROM `tbl_usuarios`
WHERE `idUsuario` = '1'

    public function servicio($id){
        $modelServicio = model('ServiciosModel');
        $modelImagen = model('ImagenesModel');
        $modelAnfitrion = model('AnfitrionesModel');
        $modelUsuario = model('UserModel');
        $modelGuardarSubServicios = model('GuardarSubServiciosModel');
        $modelGuardarPoliticaCancelacion = model('GuardarPoliticasCancelacionModel');
        $modelGuardarReglaServicio = model('GuardarReglasServiciosModel');
        $modelGuardarSaludSeguridad = model('GuardarSaludSeguridadModel');
        $modelMunicio = model('MunicipioModel');
        $modelDepartamento = model('DepartamentoModel');
        $modelPais = model('PaisesModel');
        $modelPoliticaCancelacion = model('PoliticasCancelacionModel');
        $modelReglaServicio = model('ReglasServiciosModel');
        $modelSubServicio = model('SubServiciosModel');
        $modelSaludSeguridad = model('SaludSeguridadModel');
        $modelHuesped = model('HuespedesModel');
        $modelTarifa = model('TarifasModel');
        $modelIdioma = model('IdiomasModel');
        $modelTipoHospedaje = model('TiposHospedajesModel');

        $idAnfitrion = $modelServicio->where('idServicio',$id)->findColumn('idAnfitrion');
        $idUsuario = $modelAnfitrion->where('idAnfitrion',$idAnfitrion)->findColumn('idUsuario');
        $idTarifa = $modelServicio->where('idServicio',$id)->findcolumn('idTarifa');
---
SELECT *
FROM `tbl_servicios`
WHERE `idServicio` IN ('2')
AND `idAnfitrion` IN ('1')
AND `tbl_servicios`.`date_delete` IS NULL

        $idiomaExtra = $modelAnfitrion->where('idAnfitrion',$idAnfitrion)->findColumn('idiomaExtra');
        $idTipoHospedaje = $modelServicio->where('idServicio',$id)->findColumn('idTipoHospedaje');
        $idMunicipio = $modelServicio->where('idServicio',$id)->findColumn('idMunicipio');
        $idDepartamento = $modelMunicio->where('idMunicipio',$idMunicipio)->findColumn('idDepartamento');
        $idPais = $modelDepartamento->where('idDepartamento',$idDepartamento)->findColumn('idPais');
---
SELECT `idDepartamento`
FROM `tbl_municipios`
WHERE `idMunicipio` = ('253')
SELECT `idPais`
FROM `tbl_departamentos`
WHERE `idDepartamento` = ('14')

            'politicaCancelacion' => $modelPoliticaCancelacion->whereIn('idPoliticaCancelacion',$arrayPoliticaCancelacion)->findAll(),
            'reglaServicio' => $modelReglaServicio->whereIn('idReglaServicio',$arrayReglaServicio)->findAll(),
            'saludSeguridad' => $modelSaludSeguridad->whereIn('idSaludSeguridad',$arraySaludSeguridad)->findAll(),
            'subServicio' => $modelSubServicio->whereIn('idSubServicio',$arraySubServicios)->findAll(),
---
SELECT *
FROM `tbl_sub_servicios`
WHERE `idSubServicio` IN ('1','2','3')

    public function servicioReserva($id){
        $modelServicio = model('ServiciosModel');
        $modelTarifa = model('TarifasModel');

        $idTarifa = $modelServicio->where('idServicio',$id)->findColumn('idTarifa');
        return $this->getResponse([
            'message' => 'Servicios',
            'servicio' => $modelServicio->where('idServicio',$id)->findAll(),
            'tarifa' => $modelTarifa->where('idTarifa',$idTarifa)->findAll(),
---
SELECT *
FROM `tbl_tarifas`
WHERE `idTarifa` = ('12')