app/Controllers/Servicios.php

    public function index(){
        $this->eliminarFechasReservadas();
        $model = model('UserModel');
        return $this->getResponse([
            'message' => 'Clients retrieved successfully',
            'usuarios' => $model->findAll()
        ]);
---
SELECT *
FROM `tbl_usuarios`

        return $this->getResponse([
            'message' => 'Servicios',
            'servicios' => $serviciosModel->where('estatus',1)->whereIn('idServicio',$arrayServicios)->whereIn('idAnfitrion',$arrayAnfitriones)->findAll(),
            'usuarios' => $modelUsuario->findAll(),
            'anfitriones' => $modelAnfitrion->findAll(),
            'municipios' => $modelMunicio->findAll(),
            'tarifas' => $modelTarifa->findAll(),
            'tipoHospedaje' => $modelTipoHospedaje->findAll(),
            'imagenes' => $modelImagen->findAll(),
---
SELECT *
FROM `tbl_usuarios`
SELECT *
FROM `tbl_anfitriones`
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_imagenes`

    public function serviciosPost(){
        $this->eliminarFechasReservadas();
        $input = $this->getRequestInput($this->request);

        $modelServicio = model('ServiciosModel');
        $modelImagen = model('ImagenesModel');
        $modelUsuario = model('UserModel');
        $modelAnfitrion = model('AnfitrionesModel');
        $modelMunicio = model('MunicipioModel');
        $modelTarifa = model('TarifasModel');
        $modelTipoHospedaje = model('TiposHospedajesModel');

        $idUsuario = $input['idUsuario'];

        $idAnfitrion = $modelAnfitrion->where('idUsuario',$idUsuario)->findColumn('idAnfitrion');
        $arrayAnfitriones = $modelServicio->findColumn('idAnfitrion');
        if($arrayAnfitriones == null){
            $arrayAnfitriones[] = '';
        }
        if($idAnfitrion != null){
            $arrayAnfitriones = array_diff($arrayAnfitriones,array($idAnfitrion[0]));
        }
        return $this->getResponse([
            'message' => 'Servicios',
            'servicios' => $modelServicio->where('estatus',1)->whereIn('idAnfitrion',$arrayAnfitriones)->where('estatus', 1)->findAll(),
            'usuarios' => $modelUsuario->findAll(),
            'anfitriones' => $modelAnfitrion->findAll(),
            'municipios' => $modelMunicio->findAll(),
            'tarifas' => $modelTarifa->findAll(),
            'tipoHospedaje' => $modelTipoHospedaje->findAll(),
            'imagenes' => $modelImagen->findAll(),
---
SELECT *
FROM `tbl_usuarios`
WHERE `idUsuario` = ('1')
SELECT `idAnfitrion`
FROM `tbl_anfitriones`
WHERE `idUsuario` = '1'
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_imagenes`

        return $this->getResponse([
            'message' => 'Servicios',
            'servicio' => $modelServicio->findAll(),
            'imagenes' => $modelImagen->findAll(),
---
SELECT *
FROM `tbl_imagenes`

    public function usuario($id){
        $this->eliminarFechasReservadas();
        $modelUsuario = model ('UserModel');
        $modelAnfitrion = model('AnfitrionesModel');

        return $this->getResponse([
            'message' => 'Servicios',
            'usuario' => $modelUsuario->where('idUsuario',$id)->findAll(),
---
SELECT *
FROM `tbl_usuarios`
WHERE `idUsuario` = '2'

    private function eliminarFechasReservadas(){
        $modelFechasReservadas = model('FechasReservasModel');
        $date = date('Y-m-d 00:00:00');

        $arrayEliminar = $modelFechasReservadas->where('fechaSalida <', $date)->findColumn('idFecha');

        if($arrayEliminar == null){
            $arrayEliminar[] = '';
        }

        $modelFechasReservadas->delete($arrayEliminar);
---
DELETE FROM `tbl_fechas_reservas`
WHERE `idFecha` IN ('')