app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'dimas@gmail.com'
 LIMIT 1
---
    public function findUserByEmailAddress(string $emailAddress) {
        $user = $this->asArray()->where(['email' => $emailAddress])->first();